{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "/home/image_team/image_team_docker_home/lgd/e_commerce_lmm/weights/qwen-vl-caht",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [],
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "w1",
    "attn.c_proj",
    "c_attn",
    "w2"
  ],
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": false
}